src/Documents/ПоступлениеУслуг/ПоступлениеУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПоступлениеУслуг</name>
  <attributes>
    <name>Заявка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Пост</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/ПоступлениеУслуг/Forms/Документ/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере ( Отказ, СтандартнаяОбработка )
	
	Если ( Объект.Ссылка.Пустая () ) Тогда
		ОбщийДокументы.НачальноеЗаполнение ( Объект );
	Иначе
		// код ...	
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиПриНачалеРедактирования ( Элемент, НоваяСтрока, Копирование )
	
	Если ( НоваяСтрока ) Тогда
		Элементы.Услуги.ТекущиеДанные.Количество = 1;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиКоличествоПриИзменении ( Элемент )
	
	ОбщийДокументы.РассчитатьСумму ( Элементы.Услуги.ТекущиеДанные );
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиЦенаПриИзменении ( Элемент )
	
	ОбщийДокументы.РассчитатьСумму ( Элементы.Услуги.ТекущиеДанные );	
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиСуммаПриИзменении ( Элемент )
	
	ОбщийДокументы.РассчитатьЦену ( Элементы.Услуги.ТекущиеДанные );	
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении ( Элемент )
	
	Объект.Пост = ПолучитьГоловногоКонтрагента ( Объект.Контрагент );
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьГоловногоКонтрагента ( Контрагент )
	
	пост = Справочники.Контрагенты.ПустаяСсылка ();
	Если ( ЗначениеЗаполнено ( Контрагент ) ) Тогда
		пост = Контрагент.ГоловнойКонтрагент;
	КонецЕсли; 
	Возврат пост;

КонецФункции
